Tekla.Structures.Catalogs.ComponentItem.ComponentTypeEnum
Defines the different component types.

Tekla.Structures.Catalogs.ComponentItem.ComponentTypeEnum.UNKNOWN
The unknown component type.

Tekla.Structures.Catalogs.ComponentItem.ComponentTypeEnum.CONNECTION
The component type is connection.

Tekla.Structures.Catalogs.ComponentItem.ComponentTypeEnum.COMPONENT
The component type is component.

Tekla.Structures.Catalogs.ComponentItem.ComponentTypeEnum.SEAM
The component type is seam.

Tekla.Structures.Catalogs.ComponentItem.ComponentTypeEnum.DETAIL
The component type is detail.

Tekla.Structures.Catalogs.ComponentItem.ComponentTypeEnum.CUSTOM_PART
The component type is custom part object.

Tekla.Structures.Catalogs.ComponentItem.ComponentTypeEnum.DRAWING_PLUGIN
The component type is drawing plugin.